#include "servo.h"
#include "timer.h"
/***************************************************
* 函数:Servo_Control
* 参数:angle--舵机转过的角度(0-180)
* 返回值:无返回值
* 功能:舵机需要20ms(50Hz)的基准脉冲
*  -----------------------------------
* |   0  |  45  |  90  |  135  |  180 |
* |------|------|------|-------|------|
* |  0.5 |  1.0 |  1.5 |   2.0 |  2.5 |
*  -----------------------------------
***************************************************/
void Servo_Control(uint16_t angle)
{
	float temp;
	temp = (1.0 / 9.0) * angle + 5.0;//寄存器值 = 1/9 * 角度 + 5
	TIM_SetCompare4(TIM4, (uint16_t)temp);//将角度值写入比较寄存器
}
